// const blogsData = [
//   {
//     _id: "101",
//     title: "Top 10 Interview Tips to Get Your Dream Job",
//     description:
//       "A successful interview needs confidence and preparation. Learn techniques to leave a lasting impression on recruiters.",
//     content:
//       "Interviews are not just about knowledge but also how well you present yourself. Research the company, understand the job role, practice common interview questions, and arrive on time. Dress professionally and maintain eye contact. Highlight your achievements with real examples. Ask meaningful questions about the role and the company. Lastly, always follow up with a thank-you message.",
//     image: "https://images.unsplash.com/photo-1551836022-4c4c79ecde25",
//     date: "2025-01-09"
//   },
//   {
//     _id: "102",
//     title: "How to Write a Professional Resume That Stands Out",
//     description:
//       "Your resume is your first impression to employers. Learn the best format, keywords, and tips to get shortlisted.",
//     content:
//       "A standout resume must be clear, concise, and ATS-friendly. Focus on accomplishments instead of job duties. Use bullet points and strong action verbs like managed, developed, and implemented. Tailor your resume to each job role and include measurable results. Keep the design clean and avoid unnecessary images or colors.",
//     image: "https://images.unsplash.com/photo-1557426272-fc759fdf7a8d",
//     date: "2025-01-15"
//   },
//   {
//     _id: "103",
//     title: "Career Switch Guide: How to Transition Into IT",
//     description:
//       "IT careers offer great salaries and growth. Discover how freshers and non-tech candidates can start in IT.",
//     content:
//       "To transition into IT, start by learning skills through online courses and internships. Build projects to show practical knowledge. Network with IT professionals on LinkedIn and attend workshops or hackathons. Focus on roles like Frontend Developer, QA Tester, Technical Support, or Cloud Associate as entry points.",
//     image: "https://images.unsplash.com/photo-1537432376769-00a4c3891827",
//     date: "2025-01-20"
//   },
//   {
//     _id: "104",
//     title: "LinkedIn Optimization: Get Noticed by Recruiters",
//     description:
//       "A powerful LinkedIn profile increases job visibility. Learn how to enhance your personal branding.",
//     content:
//       "Update your profile headline, add a professional profile image, and include relevant skills endorsed by peers. Post frequently about your projects, certifications, or achievements. Join professional groups and follow companies you're targeting. Write a strong about section that highlights your career goals and expertise.",
//     image: "https://images.unsplash.com/photo-1504384308090-c894fdcc538d",
//     date: "2025-02-01"
//   },
//   {
//     _id: "105",
//     title: "Top 8 Soft Skills Employers Want in 2025",
//     description:
//       "Technical skills are important — but soft skills are what make you a leader in the workplace.",
//     content:
//       "Soft skills like communication, teamwork, adaptability, problem-solving, leadership, creativity, emotional intelligence, and time management are increasingly in demand. Work on developing these skills through group tasks, real projects, and mentorship.",
//     image: "https://images.unsplash.com/photo-1552664730-d307ca884978",
//     date: "2025-02-11"
//   },
//   {
//     _id: "106",
//     title: "Work From Home Jobs: Beginners Guide",
//     description:
//       "Looking to start your career remotely? Explore trending WFH job roles and required skills.",
//     content:
//       "Work-from-home roles include Data Entry, Customer Support, Virtual Assistant, Content Writer, and Digital Marketing Associate. Make sure you have a professional home setup, a reliable internet connection, and communication skills. Build trust through timely delivery and transparency.",
//     image: "https://images.unsplash.com/photo-1587614382346-4ec70e388b28",
//     date: "2025-02-18"
//   }
// ];


